Revit 2027 API
BaseExportOptions.HatchPatternsFileName Property
 Custom hatch patterns (pat) file name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string HatchPatternsFileName { get; set; }
Public Property HatchPatternsFileName As String
	Get
	Set
public:
property String^ HatchPatternsFileName {
	String^ get ();
	void set (String^ value);
}
member HatchPatternsFileName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace